html/erlang/tutorial/sequential/list_method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>列表操作</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="match.html"> UP </a>
 |
 <a accesskey="H" href="sequential.html"> HOME </a>
</div><div id="content">
<h1 class="title">列表操作</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6e980bc">| 操作符</a></li>
<li><a href="#orgfdeaf6e">实例</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6e980bc" class="outline-2">
<h2 id="org6e980bc">| 操作符</h2>
<div class="outline-text-2" id="text-org6e980bc">
<p>
<span class="underline">|</span> 操作符可以用于取列表中的首元素:
</p>

<div class="org-src-container">
<pre class="src src-sh">1&gt; [M1|T1] = [paris, london, rome].
[paris,london,rome]

2&gt; M1.
paris

3&gt; T1.
[london,rome]
</pre>
</div>

<p>
<span class="underline">|</span> 操作符也可以用于在列表 <span class="underline">首部添加元素</span> : 
</p>

<div class="org-src-container">
<pre class="src src-sh">5&gt;  L1 = [madrid | T1]. 
[madrid,london,rome]

6&gt; L1 . 
[madrid,london,rome] 
</pre>
</div>

<p>
使用 <span class="underline">|</span> 操作符 <span class="underline">翻转列表中的元素</span> : 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(reverse).

<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">reverse/1</span>]).

<span style="color: #daa520; font-weight: bold;">reverse</span>(<span style="color: #4eee94;">List</span>) -&gt;
    <span style="color: #98f5ff;">reverse</span>(<span style="color: #4eee94;">List</span>, []).

<span style="color: #daa520; font-weight: bold;">reverse</span>([<span style="color: #4eee94;">Head</span> | <span style="color: #4eee94;">Rest</span>], <span style="color: #4eee94;">Reversed_List</span>) -&gt;
    <span style="color: #98f5ff;">reverse</span>(<span style="color: #4eee94;">Rest</span>, [<span style="color: #4eee94;">Head</span> | <span style="color: #4eee94;">Reversed_List</span>]);
<span style="color: #daa520; font-weight: bold;">reverse</span>([], <span style="color: #4eee94;">Reversed_List</span>) -&gt;
    <span style="color: #4eee94;">Reversed_List</span>.
</pre>
</div>


<p>
测试如下： 
</p>

<div class="org-src-container">
<pre class="src src-sh">3&gt; reverse:reverse([1,2,3])<span style="color: #f08080;">.</span>
[3,2,1]
</pre>
</div>

<p>
初始时 Reversed_List 其为 []，待翻转的列表的首元素被取出来再添加到 Reversed_List 列表中： 
</p>

<pre class="example">
reverse([1|2,3], []) =&gt;
    reverse([2,3], [1|[]])

reverse([2|3], [1]) =&gt;
    reverse([3], [2|[1])

reverse([3|[]], [2,1]) =&gt;
    reverse([], [3|[2,1]])

reverse([], [3,2,1]) =&gt;
    [3,2,1]
</pre>
</div>
</div>

<div id="outline-container-orgfdeaf6e" class="outline-2">
<h2 id="orgfdeaf6e">实例</h2>
<div class="outline-text-2" id="text-orgfdeaf6e">
<pre class="example">
下面回到城市与温度的话题上，但是这一次会使用更加结构化的方法
</pre>

<p>
首先，将整个列表中的温度都使用摄氏度表示： 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(temperature).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">format_temps/1</span>]).

<span style="color: #daa520; font-weight: bold;">format_temps</span>(<span style="color: #4eee94;">List_of_cities</span>) -&gt;
    <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">List_of_cities</span>).

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([{<span style="color: #4eee94;">Name</span>, {f, <span style="color: #4eee94;">F</span>}} | <span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #4eee94;">Converted_City</span> = {<span style="color: #4eee94;">Name</span>, {c, (<span style="color: #4eee94;">F</span> -32)* 5 / 9}},
    [<span style="color: #4eee94;">Converted_City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([<span style="color: #4eee94;">City</span> | <span style="color: #4eee94;">Rest</span>]) -&gt;
    [<span style="color: #4eee94;">City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([]) -&gt;
    [].
</pre>
</div>
<p>
含义如下：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">format_temps</span>(<span style="color: #4eee94;">List_of_cities</span>) -&gt;
    <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">List_of_cities</span>).
</pre>
</div>

<p>
format_temps/1 调用 convert_list_to_c/1 函数。covert_list_to_c/1 函数移除 List_of_cities 的首元素，并将其转换为摄氏单位表示 （如果需要）。| 操作符用来将被转换后的元素添加到转换后的剩余列表中：
</p>

<div class="org-src-container">
<pre class="src src-erlang">[<span style="color: #4eee94;">Converted_City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];
</pre>
</div>

<p>
或者：
</p>

<div class="org-src-container">
<pre class="src src-erlang">[<span style="color: #4eee94;">City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];
</pre>
</div>

<p>
一直重复上述过程直到列表空为止。当列表为空时，则执行：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([]) -&gt;
    [].
</pre>
</div>

<p>
测试下：
</p>
<div class="org-src-container">
<pre class="src src-sh">2&gt; temperature:format_temps([{moscow, {c, -10}}, {cape_town, {f, 70}},
2&gt; {stockholm, {c, -4}}, {paris, {f, 28}}, {london, {f, 36}}]) <span style="color: #f08080;">.</span>      

[{moscow,{c,-10}},
 {cape_town,{c,21.11111111111111}},
 {stockholm,{c,-4}},
 {paris,{c,-2.2222222222222223}},
 {london,{c,2.2222222222222223}}]
</pre>
</div>

<p>
当列表被转换后，用新增的打印输出函数将其输出：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(temperature).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">format_temps/1</span>]).

<span style="color: #daa520; font-weight: bold;">format_temps</span>(<span style="color: #4eee94;">List_of_cities</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">convert_list_to_c(List_of_cities).</span>
    <span style="color: #4eee94;">Converted_List</span> = <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">List_of_cities</span>),
    <span style="color: #98f5ff;">print_temp</span>(<span style="color: #4eee94;">Converted_List</span>).

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([{<span style="color: #4eee94;">Name</span>, {f, <span style="color: #4eee94;">F</span>}} | <span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #4eee94;">Converted_City</span> = {<span style="color: #4eee94;">Name</span>, {c, (<span style="color: #4eee94;">F</span> -32)* 5 / 9}},
    [<span style="color: #4eee94;">Converted_City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([<span style="color: #4eee94;">City</span> | <span style="color: #4eee94;">Rest</span>]) -&gt;
    [<span style="color: #4eee94;">City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([]) -&gt;
    [].

<span style="color: #daa520; font-weight: bold;">print_temp</span>([{<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}} | <span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~-15w ~w c~n"</span>, [<span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">Temp</span>]),
    <span style="color: #98f5ff;">print_temp</span>(<span style="color: #4eee94;">Rest</span>);
<span style="color: #daa520; font-weight: bold;">print_temp</span>([]) -&gt;
    ok.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">4&gt; temperature:format_temps([{moscow, {c, -10}}, {cape_town, {f, 70}},
4&gt; {stockholm, {c, -4}}, {paris, {f, 28}}, {london, {f, 36}}]) <span style="color: #f08080;">.</span>      

moscow          -10 c
cape_town       21.11111111111111 c
stockholm       -4 c
paris           -2.2222222222222223 c
london          2.2222222222222223 c
ok
</pre>
</div>

<p>
接下来，添加一个函数来搜索拥有最高温度与最低温度值的城市：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(temperature).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">format_temps/1</span>]).

<span style="color: #daa520; font-weight: bold;">format_temps</span>(<span style="color: #4eee94;">List_of_cities</span>) -&gt;
    <span style="color: #4eee94;">Converted_List</span> = <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">List_of_cities</span>),
    <span style="color: #98f5ff;">print_temp</span>(<span style="color: #4eee94;">Converted_List</span>),
    {<span style="color: #4eee94;">Max_city</span>, <span style="color: #4eee94;">Min_city</span>} = <span style="color: #98f5ff;">find_max_and_min</span>(<span style="color: #4eee94;">Converted_List</span>),
    <span style="color: #98f5ff;">print_max_and_min</span>(<span style="color: #4eee94;">Max_city</span>, <span style="color: #4eee94;">Min_city</span>).

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([{<span style="color: #4eee94;">Name</span>, {f, <span style="color: #4eee94;">F</span>}} | <span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #4eee94;">Converted_City</span> = {<span style="color: #4eee94;">Name</span>, {c, (<span style="color: #4eee94;">F</span> -32)* 5 / 9}},
    [<span style="color: #4eee94;">Converted_City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([<span style="color: #4eee94;">City</span> | <span style="color: #4eee94;">Rest</span>]) -&gt;
    [<span style="color: #4eee94;">City</span> | <span style="color: #98f5ff;">convert_list_to_c</span>(<span style="color: #4eee94;">Rest</span>)];

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>([]) -&gt;
    [].

<span style="color: #daa520; font-weight: bold;">print_temp</span>([{<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}} | <span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~-15w ~w c~n"</span>, [<span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">Temp</span>]),
    <span style="color: #98f5ff;">print_temp</span>(<span style="color: #4eee94;">Rest</span>);
<span style="color: #daa520; font-weight: bold;">print_temp</span>([]) -&gt;
    ok.

<span style="color: #daa520; font-weight: bold;">find_max_and_min</span>([<span style="color: #4eee94;">City</span> | <span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #98f5ff;">find_max_and_min</span>(<span style="color: #4eee94;">Rest</span>, <span style="color: #4eee94;">City</span>, <span style="color: #4eee94;">City</span>).

<span style="color: #daa520; font-weight: bold;">find_max_and_min</span>([{<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}} | <span style="color: #4eee94;">Rest</span>], 
                 {<span style="color: #4eee94;">Max_Name</span>, {c, <span style="color: #4eee94;">Max_Temp</span>}}, 
                 {<span style="color: #4eee94;">Min_Name</span>, {c, <span style="color: #4eee94;">Min_Temp</span>}}) -&gt;
    <span style="color: #00bfff; font-weight: bold;">if</span> 
        <span style="color: #4eee94;">Temp</span> &gt; <span style="color: #4eee94;">Max_Temp</span> -&gt;
            <span style="color: #4eee94;">Max_City</span> = {<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}};           <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Change</span>
        true -&gt;<span style="color: #daa520; font-weight: bold;"> </span>
            <span style="color: #4eee94;">Max_City</span> = {<span style="color: #4eee94;">Max_Name</span>, {c, <span style="color: #4eee94;">Max_Temp</span>}} <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Unchanged</span>
    <span style="color: #00bfff; font-weight: bold;">end</span>,
    <span style="color: #00bfff; font-weight: bold;">if</span>
        <span style="color: #4eee94;">Temp</span> &lt; <span style="color: #4eee94;">Min_Temp</span> -&gt;
            <span style="color: #4eee94;">Min_City</span> = {<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}};           <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Change</span>
        true -&gt;<span style="color: #daa520; font-weight: bold;"> </span>
            <span style="color: #4eee94;">Min_City</span> = {<span style="color: #4eee94;">Min_Name</span>, {c, <span style="color: #4eee94;">Min_Temp</span>}} <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Unchanged</span>
    <span style="color: #00bfff; font-weight: bold;">end</span>,
    <span style="color: #98f5ff;">find_max_and_min</span>(<span style="color: #4eee94;">Rest</span>, <span style="color: #4eee94;">Max_City</span>, <span style="color: #4eee94;">Min_City</span>);

<span style="color: #daa520; font-weight: bold;">find_max_and_min</span>([], <span style="color: #4eee94;">Max_City</span>, <span style="color: #4eee94;">Min_City</span>) -&gt;
    {<span style="color: #4eee94;">Max_City</span>, <span style="color: #4eee94;">Min_City</span>}.

<span style="color: #daa520; font-weight: bold;">print_max_and_min</span>({<span style="color: #4eee94;">Max_name</span>, {c, <span style="color: #4eee94;">Max_temp</span>}}, {<span style="color: #4eee94;">Min_name</span>, {c, <span style="color: #4eee94;">Min_temp</span>}}) -&gt;
    <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Max temperature was ~w c in ~w~n"</span>, [<span style="color: #4eee94;">Max_temp</span>, <span style="color: #4eee94;">Max_name</span>]),
    <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Min temperature was ~w c in ~w~n"</span>, [<span style="color: #4eee94;">Min_temp</span>, <span style="color: #4eee94;">Min_name</span>]).

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">6&gt; temperature:format_temps([{moscow, {c, -10}}, {cape_town, {f, 70}},
6&gt; {stockholm, {c, -4}}, {paris, {f, 28}}, {london, {f, 36}}]) <span style="color: #f08080;">.</span>      

moscow          -10 c
cape_town       21.11111111111111 c
stockholm       -4 c
paris           -2.2222222222222223 c
london          2.2222222222222223 c
Max temperature was 21.11111111111111 c<span style="color: #00bfff; font-weight: bold;"> in</span> cape_town
Min temperature was -10 c<span style="color: #00bfff; font-weight: bold;"> in</span> moscow
</pre>
</div>

<pre class="example">
现在的代码并不是最高效的方式，因为它遍历了四次列表

但是首先应当保证程序的清晰性和正确性，然后才是想办法提高程序的效率
</pre>

<p>
<a href="condition.html">Next：条件判断</a>
</p>

<p>
<a href="match.html">Previous：匹配和作用域</a>
</p>

<p>
<a href="sequential.html">Home：顺序编程</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
